LuaVan/Luan_van/src/BusinessProcesses/ProgramApprovalProcess/ProgramApprovalProcess.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ProgramApprovalProcess</name>
  <task>Task.ProgramApprovalTasks</task>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

LuaVan/Luan_van/src/Enums/ApprovalLevel/ApprovalLevel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalLevel</name>
  <enumValues>
    <name>Faculty</name>
  </enumValues>
  <enumValues>
    <name>FacultyCouncil</name>
  </enumValues>
  <enumValues>
    <name>InstitutionalCouncil</name>
  </enumValues>
  <enumValues>
    <name>BoardOfTrustees</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Enums/ApprovalDecision/ApprovalDecision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalDecision</name>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>RequiresRevision</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Documents/ProgramApproval/ProgramApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramApproval</name>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevel</types>
    </type>
  </attributes>
  <attributes>
    <name>BasedOnProposal</name>
    <type>
      <types>DocumentRef.ProgramProposal</types>
    </type>
  </attributes>
  <attributes>
    <name>CouncilSession</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Decision</name>
    <type>
      <types>EnumRef.ApprovalDecision</types>
    </type>
  </attributes>
  <attributes>
    <name>RevisionNotes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>SignerSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>VotingResults</name>
    <attributes>
      <name>CouncilMember</name>
      <type>
        <types>CatalogRef.Lecturers</types>
      </type>
    </attributes>
    <attributes>
      <name>Vote</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

LuaVan/Luan_van/src/BusinessProcesses/ProgramApprovalProcess/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// BusinessProcess.ProgramApprovalProcess - Object Module
//
// 4 BeforeCreateTasks handlers (T1-T4): set Performer dynamic theo Role
// 4 Condition CheckCondition handlers: rẽ nhánh theo Decision của ProgramApproval
//
// CẦN: BP có attribute TargetProgram (CatalogRef.TrainingPrograms)
////////////////////////////////////////////////////////////////////////////////

#Region TaskCreationHandlers

// T1 - Soạn đề xuất CTĐT
Procedure PrepareProposalBeforeCreateTasks(RoutePoint, TasksBeingFormed, StandardProcessing)
	Faculty = GetProposingFacultyOrDefault();
	Performer = WorkflowAddressing.FindAnyLecturerInFaculty(Faculty);
	For Each Task In TasksBeingFormed Do
		Task.Performer = Performer;
		Task.Description = "T1 - Soạn đề xuất CTĐT";
	EndDo;
EndProcedure

// T2 - HĐKH Khoa phê duyệt
Procedure FacultyCouncilReviewBeforeCreateTasks(RoutePoint, TasksBeingFormed, StandardProcessing)
	Faculty = GetProposingFacultyOrDefault();
	Performer = WorkflowAddressing.FindHead(Faculty);
	For Each Task In TasksBeingFormed Do
		Task.Performer = Performer;
		Task.Description = "T2 - HĐKH Khoa phê duyệt CTĐT";
	EndDo;
EndProcedure

// T3 - HĐKHĐT Trường thẩm định
Procedure InstitutionalReviewBeforeCreateTasks(RoutePoint, TasksBeingFormed, StandardProcessing)
	Performer = WorkflowAddressing.FindInstitutionalHead();
	For Each Task In TasksBeingFormed Do
		Task.Performer = Performer;
		Task.Description = "T3 - HĐKHĐT Trường thẩm định CTĐT";
	EndDo;
EndProcedure

// T4 - Trình Giám đốc ký QĐ ban hành
Procedure IssueDecisionBeforeCreateTasks(RoutePoint, TasksBeingFormed, StandardProcessing)
	Performer = WorkflowAddressing.FindDean();
	For Each Task In TasksBeingFormed Do
		Task.Performer = Performer;
		Task.Description = "T4 - Trình Giám đốc ký QĐ ban hành";
	EndDo;
EndProcedure

#EndRegion

#Region ConditionHandlers

// Sau T2 (Khoa) - Cond1: Approved?
//   Yes → T3 (đi tiếp lên Trường)
//   No  → Cond2 (check tiếp)
Procedure IsApprovedConditionCheck(RoutePoint, Result)
	LatestDecision = GetLatestDecision(Enums.ApprovalLevel.FacultyCouncil);
	Result = (LatestDecision = Enums.ApprovalDecision.Approved);
EndProcedure

// Sau Cond1 (No) - Cond2: RequiresRevision?
//   Yes → T1 (quay lại sửa)
//   No  → End (Rejected)
Procedure NeedsRevisionConditionCheck(RoutePoint, Result)
	LatestDecision = GetLatestDecision(Enums.ApprovalLevel.FacultyCouncil);
	Result = (LatestDecision = Enums.ApprovalDecision.RequiresRevision);
EndProcedure

// Sau T3 (Trường) - Cond3: Approved?
//   Yes → T4 (ban hành)
//   No  → Cond4
Procedure IsApprovedInstConditionCheck(RoutePoint, Result)
	LatestDecision = GetLatestDecision(Enums.ApprovalLevel.InstitutionalCouncil);
	Result = (LatestDecision = Enums.ApprovalDecision.Approved);
EndProcedure

// Sau Cond3 (No) - Cond4: RequiresRevision?
//   Yes → T1 (quay lại sửa từ đầu)
//   No  → End (Rejected)
Procedure NeedsRevisionInstConditionCheck(RoutePoint, Result)
	LatestDecision = GetLatestDecision(Enums.ApprovalLevel.InstitutionalCouncil);
	Result = (LatestDecision = Enums.ApprovalDecision.RequiresRevision);
EndProcedure

#EndRegion

#Region Helpers

// Lấy Decision mới nhất của ProgramApproval cho CTĐT này tại cấp Level
Function GetLatestDecision(Level)
	If TargetProgram.IsEmpty() Then
		Return Enums.ApprovalDecision.EmptyRef();
	EndIf;

	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	ProgramApproval.Decision AS Decision
	|FROM
	|	Document.ProgramApproval AS ProgramApproval
	|WHERE
	|	ProgramApproval.TargetProgram = &TargetProgram
	|	AND ProgramApproval.ApprovalLevel = &Level
	|	AND ProgramApproval.Posted = TRUE
	|ORDER BY
	|	ProgramApproval.Date DESC";
	Query.SetParameter("TargetProgram", TargetProgram);
	Query.SetParameter("Level", Level);

	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Decision;
	EndIf;
	Return Enums.ApprovalDecision.EmptyRef();
EndFunction

// Lookup Faculty đề xuất từ Document ProgramProposal mới nhất
// Fallback CNTT1 nếu chưa có
Function GetProposingFacultyOrDefault()
	If Not TargetProgram.IsEmpty() Then
		Faculty = WorkflowAddressing.GetProposingFaculty(TargetProgram);
		If Not Faculty.IsEmpty() Then
			Return Faculty;
		EndIf;
	EndIf;
	Return Catalogs.Faculties.FindByCode("CNTT1");
EndFunction

#EndRegion
